{
  "backend/main.mo": "Motoko canister implementing user profiles, session creation, access control checks, and attendance recording with maps and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, test IDs, and confidence values.",
  "frontend-file-summaries.txt": "List of short summaries for all frontend source files describing their roles in routing, UI, hooks, and feature logic.",
  "frontend/DELIVERY.md": "Documentation explaining PWA delivery, Android installation steps, and how to wrap the app into an APK via TWA tools.",
  "frontend/index.css": "Tailwind-based global styles defining color tokens, dark mode variables, and base theme settings.",
  "frontend/index.html": "Main HTML entry with metadata, PWA manifest, root mount point, and service worker registration.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, theme colors, and display behavior.",
  "frontend/public/sw.js": "Service worker implementing basic caching, offline fallback, and cache version cleanup.",
  "frontend/src/App.tsx": "Main React router setup with splash logic, auth/profile‑aware redirects, and route definitions for all pages.",
  "frontend/src/components/auth/AdminRoute.tsx": "Route guard that checks admin status and redirects unauthorized users to the access-denied page.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard that blocks access until Internet Identity is loaded and redirects unauthenticated users to login.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Empty file placeholder for a user profile setup dialog component.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing page container and persistent bottom navigation.",
  "frontend/src/components/layout/BottomNav.tsx": "Renders a bottom navigation bar with dynamic items based on admin status and highlights the active route.",
  "frontend/src/components/scan/CheckInResultCard.tsx": "Displays a check‑in result with status-based icon, title, message, and a retry button.",
  "frontend/src/components/scan/ManualEntryPanel.tsx": "Provides a form for manually entering a QR code and submitting it.",
  "frontend/src/components/scan/ScannerPanel.tsx": "Implements camera-based QR scanning with controls for start, stop, switching cameras, and handling scan results.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides hooks for fetching and updating the caller’s user profile and role, including admin checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication state and login/logout.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for sessions and attendance, including fetching, creating sessions, and check‑ins.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes React, wraps the app with React Query and Internet Identity providers, and mounts it.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Shows an access denied message for non-teachers with a button to return to the dashboard.",
  "frontend/src/pages/admin/AdminAttendanceOverviewPage.tsx": "Admin page to select a session and view its attendance list with date and time details.",
  "frontend/src/pages/admin/AdminSessionsPage.tsx": "Admin UI for listing sessions, creating new ones, and validating start/end times before submitting via createSession.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing user greeting, logout, navigation cards, and admin-only session management links.",
  "frontend/src/pages/DeliveryNotesPage.tsx": "Displays installation notes and APK build instructions including Bubblewrap commands with copy support.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity with a sign-in button and error handling.",
  "frontend/src/pages/RegistrationPage.tsx": "Registration form to save user profile and role, then redirect to the dashboard.",
  "frontend/src/pages/ScanCheckInPage.tsx": "QR scan and manual entry check‑in page that validates sessions and displays result states.",
  "frontend/src/pages/SplashPage.tsx": "Splash screen with branding, illustration, and loading animation.",
  "frontend/src/pages/user/AttendanceHistoryPage.tsx": "Displays a user's attendance history, resolving session names and formatting timestamps, with loading and empty states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL params, persisting them in sessionStorage, and cleaning parameters from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, container settings, and plugin usage.",
  "project_state.json": "Project metadata describing requirements, features, architecture notes, and current build state for the attendance system."
}