{
  "backend/main.mo": "Motoko canister implementing user profiles, sessions, attendance tracking, and permission‑checked CRUD operations with simple in‑memory Maps.",
  "backend/migration.mo": "Defines old/new actor state types and a no‑op migration that returns the prior stored state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing routing, auth, scanning, dashboards, and admin pages.",
  "frontend/DELIVERY.md": "Delivery notes explaining PWA installation, Android TWA APK packaging, and build steps.",
  "frontend/index.css": "Tailwind CSS setup defining OKLCH theme tokens and light/dark mode variables.",
  "frontend/index.html": "HTML entry point loading the React app, manifest, icons, and service worker.",
  "frontend/public/manifest.json": "PWA manifest specifying app metadata, theme colors, and icons.",
  "frontend/public/sw.js": "Service worker handling install, cache population, fetch fallback, and cache version cleanup.",
  "frontend/src/App.tsx": "Sets up the root layout, splash logic, authentication redirects, and defines public and protected routes for the app.",
  "frontend/src/components/auth/AdminRoute.tsx": "Guards child components so only admin users can access them, redirecting unauthorized users to an access-denied page.",
  "frontend/src/components/auth/AuthGate.tsx": "Ensures a user is authenticated before rendering children, redirecting unauthenticated users to the login page.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Empty placeholder component file for a profile setup dialog.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with a centered content container and bottom navigation.",
  "frontend/src/components/layout/BottomNav.tsx": "Renders a responsive bottom navigation bar with links that adapt based on whether the user is an admin.",
  "frontend/src/components/scan/CheckInResultCard.tsx": "Displays the result of a check‑in attempt with an icon, message, optional session name, and retry button.",
  "frontend/src/components/scan/ManualEntryPanel.tsx": "Provides a form for manually entering a QR code fallback with submit handling.",
  "frontend/src/components/scan/ScannerPanel.tsx": "Implements a camera-based QR scanner UI with start/stop controls, camera switching, and automatic scan handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides hooks for fetching, saving, and checking the current user's profile and role using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading stored identities and exposing login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating session and attendance data through the actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme CSS variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Renders an access-denied message with a prompt to return to the dashboard.",
  "frontend/src/pages/admin/AdminAttendanceOverviewPage.tsx": "Allows admins to select a session and view its attendance list with date/time formatting and loading states.",
  "frontend/src/pages/admin/AdminSessionsPage.tsx": "Provides session management UI for admins, including session creation and listing with date/time validation.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user info and navigation cards for scanning, history, and teacher admin tools.",
  "frontend/src/pages/DeliveryNotesPage.tsx": "Explains PWA installation steps and advanced APK creation instructions.",
  "frontend/src/pages/LoginPage.tsx": "Presents the login screen using Internet Identity with basic error handling.",
  "frontend/src/pages/RegistrationPage.tsx": "Handles user registration by saving name and role before directing to the dashboard.",
  "frontend/src/pages/ScanCheckInPage.tsx": "Renders a QR and manual check-in interface, validates scanned codes, checks session timing, and performs check-in mutations.",
  "frontend/src/pages/SplashPage.tsx": "Displays the branded splash screen with logo, illustration, and loading animation.",
  "frontend/src/pages/user/AttendanceHistoryPage.tsx": "Shows a user's attendance history with session names and formatted check-in timestamps.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, container queries, and plugins.",
  "project_state.json": "Defines overall project state, including Android-app deliverable goals, architectural notes, and a list of existing features for the QR-based attendance system. Contains versioning, requirements links, and guidance for onboarding, roles, UI, PWA, and QR scanning."
}