{
  "kind": "build_request",
  "title": "Expose APK packaging guidance and delivery instructions in-app",
  "projectName": "QR Attend",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Add a visible navigation entry to the existing Delivery Notes screen so users can easily find installation and APK-wrapping instructions from within the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "yeah give me"
        ]
      },
      "acceptanceCriteria": [
        "Bottom navigation includes a new item labeled \"Delivery\" (or \"Delivery Notes\") that routes to the existing /delivery page.",
        "The new navigation item is available to all authenticated users (Teacher and Student).",
        "When the user taps the new item, the Delivery Notes page renders inside the standard AppLayout without errors."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Update the Delivery Notes UI content to more directly answer requests for a downloadable Android APK by clearly stating that the platform outputs a web/PWA build and providing copy-pasteable steps for producing an APK externally via TWA (Bubblewrap) and PWA Builder.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "yeah give me"
        ]
      },
      "acceptanceCriteria": [
        "Delivery Notes page includes explicit English wording that a pre-built downloadable APK is not produced directly by this platform.",
        "Delivery Notes page includes a clearly formatted Bubblewrap command snippet and a link to https://www.pwabuilder.com.",
        "Instructions mention that the app must be deployed to a public HTTPS URL before generating a TWA APK.",
        "All user-facing text on the Delivery Notes page remains in English."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Do not implement an on-platform APK build pipeline; only provide guidance and UI documentation for external APK packaging."
  ],
  "nonGoals": [
    "Generating or hosting an Android APK directly from this project build output.",
    "Adding third-party authentication providers or non-Internet-Identity login methods.",
    "Adding new backend functionality unrelated to delivery/APK guidance."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}