{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "QR Attend — In-app Delivery/APK guidance navigation and content updates",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Add a bottom navigation item that routes authenticated users to the existing Delivery Notes screen (/delivery).",
      "acceptanceCriteria": [
        "Bottom navigation includes a new item labeled \"Delivery\" (or \"Delivery Notes\") that routes to the existing /delivery page.",
        "The new navigation item is available to all authenticated users (Teacher and Student).",
        "When the user taps the new item, the Delivery Notes page renders inside the standard AppLayout without errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/BottomNav.tsx",
          "operation": "modify",
          "description": "Add a new bottom-nav item (label \"Delivery\" or \"Delivery Notes\") that navigates to '/delivery' for all authenticated users; keep existing teacher/admin-only items intact and do not modify any files under frontend/src/components/ui."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Revise Delivery Notes page copy to clearly explain no pre-built APK is produced and provide copy-pasteable Bubblewrap and PWA Builder steps.",
      "acceptanceCriteria": [
        "Delivery Notes page includes explicit English wording that a pre-built downloadable APK is not produced directly by this platform.",
        "Delivery Notes page includes a clearly formatted Bubblewrap command snippet and a link to https://www.pwabuilder.com.",
        "Instructions mention that the app must be deployed to a public HTTPS URL before generating a TWA APK.",
        "All user-facing text on the Delivery Notes page remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DeliveryNotesPage.tsx",
          "operation": "modify",
          "description": "Update the Delivery Notes UI text (English-only) to explicitly state the platform produces a web/PWA build (not a pre-built downloadable APK), add a clearly formatted copy/paste Bubblewrap snippet (including init/build commands), include an explicit prerequisite that the app must be deployed to a public HTTPS URL, and include a visible link to https://www.pwabuilder.com; compose with existing UI components only (do not modify frontend/src/components/ui)."
        },
        {
          "path": "frontend/DELIVERY.md",
          "operation": "modify",
          "description": "Align the repository delivery documentation with the updated in-app Delivery Notes copy (Bubblewrap snippet, PWA Builder link, and public HTTPS prerequisite), without introducing any on-platform APK build pipeline steps."
        }
      ]
    }
  ]
}